cask_args appdir: '/Applications'

tap 'homebrew/binary'

# Languages
brew 'haskell-stack'
brew 'go'
brew 'python'
brew 'python3'

# Node
brew 'nvm'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Docker
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'

# Utilities
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'fzf'
brew 'gcc', args: ['without-multilib']
brew 'gdb'
brew 'grep', args: ['with-default-names']
brew 'htop'
brew 'ngrok2'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'wget'

# Databases
brew 'mongodb'
brew 'mysql'
brew 'sqlite'
brew 'postgres'

# Editors
brew 'vim'

# VCS
brew 'git'
brew 'hub'

# Media
brew 'imagemagick'

# Other
brew 'android-sdk'
brew 'awscli'
brew 'heroku'
brew 'kubernetes-cli'
brew 'nginx'
brew 'reattach-to-user-namespace'

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Communication
cask 'limechat'
cask 'skype'
cask 'slack'
cask 'telegram'
cask 'whatsapp'

# Development
cask 'dash'
cask 'iterm2-beta'
cask 'paw'
cask 'postico'
cask 'sequel-pro'
cask 'trailer'
cask 'virtualbox'

# Entertainment
cask 'spotify'

# Image and video
cask 'gimp'
cask 'vlc'

# Utilities
cask 'alfred'
cask 'caffeine'
cask 'dash'
cask 'dropbox'
cask 'transmission'
