tap 'homebrew/cask-fonts'

# Tools
brew 'gpg'
brew 'fzf'
brew 'htop'
brew 'hub'
brew 'gh'
brew 'neovim'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'zsh-syntax-highlighting'

# Needed for pyenv install
brew 'pyenv'
brew 'xz'

# Used to manage ruby versions
brew 'chruby'
brew 'ruby-install'

# Needed for saving gpg passphrase to osx keychain
brew 'pinentry-mac'

# LSP stuff
brew 'lua-language-server'  # needed by nvim lsp lua_ls

# Some apps
cask 'alacritty'
cask 'caffeine'
cask 'google-chrome'
cask 'protonvpn'
cask 'qbittorrent'
cask 'spotify'
cask 'tor-browser'
cask 'vlc'

# Communication
cask 'signal'
cask 'telegram'
cask 'whatsapp'

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-hack-nerd-font'

# Audio
cask 'blackhole-16ch'
cask 'vcv-rack'  # Needs rosetta
